<?php
error_reporting(0);
$id = isset($_GET['id'])?$_GET['id']:'cctv1';
$n = [
'cctv1' => '608807420', //CCTV1综合
'cctv2' => '631780532', //CCTV2财经
'cctv3' => '624878271', //CCTV3综艺
'cctv4' => '631780421', //CCTV4中文国际
'cctv4a' => '608807416', //CCTV4美洲
'cctv4o' => '608807419', //CCTV4欧洲
'cctv5' => '641886683', //CCTV5体育
'cctv5p' => '641886773', //CCTV5+体育赛事
'cctv6' => '624878396', //CCTV6电影
'cctv7' => '673168121', //CCTV7国防军事
'cctv8' => '624878356', //CCTV8电视剧
'cctv9' => '673168140', //CCTV9纪录
'cctv10' => '624878405', //CCTV10科教
'cctv11' => '667987558', //CCTV11戏曲
'cctv12' => '673168185', //CCTV12社会与法
'cctv13' => '608807423', //CCTV13新闻
'cctv14' => '624878440', //CCTV14少儿
'cctv15' => '673168223', //CCTV15音乐
'cctv17' => '673168256', //CCTV17农业农村

'fxzl' => '624878970', //CCTV发现之旅
'zxs' => '708869532', //CCTV中学生

'cgtn' => '609017205', //CGTN
'cgtnjl' => '609006487', //CGTN纪录
'cgtne' => '609006450', //CCTV西班牙语
'cgtnf' => '609006476', //CCTV法语
'cgtna' => '609154345', //CCTV阿拉伯语
'cgtnr' => '609006446', //CCTV俄语

'chcdz' => '644368714', //CHC动作电影x
'chcjt' => '644368373', //CHC家庭影院x

'bjws' => '630287636', //北京卫视
'dfws' => '651632648', //东方卫视x
'cqws' => '738910914', //重庆卫视
'jlws' => '738906889', //吉林卫视
'lnws' => '630291707', //辽宁卫视
'nmws' => '738911430', //内蒙古卫视
'nxws' => '738910535', //宁夏卫视
'gsws' => '738910997', //甘肃卫视
'qhws' => '738898486', //青海卫视
'sxws' => '738910838', //陕西卫视
'sdws' => '738910366', //山东卫视
'hubws' => '738906825', //湖北卫视
'hunws' => '635491149', //湖南卫视x
'jxws' => '783847495', //江西卫视
'jsws' => '623899368', //江苏卫视
'gdws' => '608831231', //广东卫视
'dwqws' => '608917627', //大湾区卫视
'gxws' => '783844132', //广西卫视
'ynws' => '783846580', //云南卫视
'gzws' => '783845222', //贵州卫视
'scws' => '738910804', //四川卫视
'xjws' => '738910476', //新疆卫视
'xzws' => '738910461', //西藏卫视
'hinws' => '738906860', //海南卫视

'bjjskj' => '641874369', //BRTV纪实科教x
'shdy' => '721355039', //四海钓鱼

'dfys' => '617290047', //东方影视
'shxwzh' => '651632657', //上海新闻综合
'dycj' => '608780988', //上海第一财经
'shjsrw' => '617289997', //上视纪实人文
'shics' => '618954688', //上海外语
'fztd' => '631095330', //法治天地

'lttv' => '668225749', //临洮电视台

'clzh' => '733532221', //昌黎融媒体中心

'sdjy' => '609154353', //山东教育

'jyjs' => '623604663', //金鹰纪实

'jscs' => '626064714', //江苏城市
'jszy' => '626065193', //江苏综艺
'jsys' => '626064697', //江苏影视
'jsggxw' => '626064693', //江苏公共新闻
'jsgj' => '626064674', //江苏国际
'jsjy' => '628008321', //江苏教育
'jslz' => '626064675', //江苏靓妆
'jsxx' => '626881786', //江苏学习
'ymkt' => '626064703', //优漫卡通

'haxwzh' => '639731826', //淮安新闻综合
'lygxwzh' => '639731715', //连云港新闻综合
'szxwzh' => '639731952', //苏州新闻综合
'tzxwzh' => '639731818', //泰州新闻综合
'wxxwzh' => '639737327', //无锡新闻综合
'sqxwzh' => '639731832', //宿迁新闻综合
'xzxwzh' => '639731747', //徐州新闻综合
'zjxwzh' => '639731783', //镇江新闻综合

'gdys' => '614961829', //广东影视x
'jjkt' => '614952364', //嘉佳卡通

'agyz' => '625526423', //爱国影展
'bkdhdy' => '625204865', //爆款动画电影
'clzpj' => '707671890', //成龙作品集
'cawyyy' => '715451506', //纯爱文艺影院
'djfy' => '625525181', //电竞风云(盗墓方法论)
'dkzxc' => '6859024501', //大咖在现场
'gdjys' => '631354620', //掼蛋精英赛
'glzpj' => '639528313', //古龙作品集
'gnslsk' => '625542365', //高能烧脑时刻
'gqdp' => '629943678', //高清大片
'hsdzjc' => '634274665', //红色谍战剧场
'hslbt' => '713600957', //红色轮播台
'hjlp' => '621640582', //怀旧老片
'hysj' => '617432328', //环游世界
'jkzg' => '685902423', //健康中国
'jyyy' => '625681367', //解压影院
'jypd' => '625774640', //金庸
'jddhdjh' => '629942219', //经典动画大集合
'jdxgdy' => '625703337', //经典香港电影(约你看韩影)
'jljc' => '625643517', //军旅剧场
'jsdp' => '617432318', //军事迷必看大片
'khdy' => '713591450', //科幻电影x
'lcwyy' => '623338112', //梁朝伟影院
'lzyjc' => '627033504', //林正英剧场x
'ldhyy' => '659315648', //刘德华影院
'mxfdhg' => '625133682', //梅西经典回顾
'mgdysk' => '639528386', //美国电影时刻
'mg24hty' => '654102378', //咪咕24小时体育台
'mgdjfs' => '625498432', //咪咕独家放送
'qnrl' => '732739753', //全民热练24小时轮播台
'rjlb' => '629943613', //热剧联播
'sszjd' => '646596895', //赛事最经典
'slzgf' => '639528330', //少林真功夫
'sddh' => '637483721', //试胆大会
'snh' => '639528180', //SNH48剧场公演
'ttmlh' => '629943305', //体坛名栏汇
'txkdy' => '627198822', //泰想看电影
'tyxx' => '626064707', //体育休闲
'tyysjz' => '625774662', //体育影视佳作
'wpdwp' => '627198692', //王牌对王牌
'wqclyy' => '627198191', //温情催泪影院
'wjzpj' => '625681368', //吴京作品集
'xyfq' => '627198751', //西域风情(经典影视速看)
'xjlm' => '637444830', //喜剧联盟
'xczx' => '713589837', //乡村振兴
'xpfyt' => '619495952', //新片放映厅
'yxels' => '702494098', //影像俄罗斯
'ydsp' => '625155140', //印度神片
'yfgmxzs' => '627198610', //预防感冒小知识
'ytya' => '625542372', //粤听粤爱
'zgryy' => '707689526', //张国荣影院
'zqzyp' => '629942228', //最强综艺趴
'zrfyy' => '639526984', //周润发影院
'zxcyy' => '623338112', //周星驰影院
'zhyl' => '617432328', //智慧养老
'zjys' => '685902264', //走进艺术
'zjyx' => '625759558', //致敬英雄(世界杯遗珠大赏)

'xmpd' => '609158151', //熊猫01高清
'xm1' => '608933610', //熊猫1
'xm2' => '608933640', //熊猫2
'xm3' => '608934619', //熊猫3
'xm4' => '608934721', //熊猫4
'xm5' => '608935104', //熊猫5
'xm6' => '608935797', //熊猫6
'xm7' => '609169286', //熊猫7
'xm8' => '609169287', //熊猫8
'xm9' => '609169226', //熊猫9
'xm10' => '609169285', //熊猫10
'xmyyzyt' => '717486418', //熊猫音乐治愈台

'kk1' => '670427084', //空中课堂一年级
'kk2' => '670427069', //空中课堂二年级
'kk3' => '670427087', //空中课堂三年级
'kk4' => '670427102', //空中课堂四年级
'kk5' => '670427124', //空中课堂五年级
'kk6' => '670427112', //空中课堂六年级
'kk7' => '670427116', //空中课堂七年级
'kk8' => '670427201', //空中课堂八年级
'kk9' => '670427227', //空中课堂九年级
'kkg1' => '670427199', //空中课堂高一
'kkg2' => '670427200', //空中课堂高二
'kkg3' => '670427221', //空中课堂高三
];

$d = file_get_contents('http://m.miguvideo.com/playurl/v1/play/playurlh5?contId='.$n[$id]);
$e = json_decode($d)->body->urlInfo->url;

$uas = parse_url($e);
parse_str($uas["query"],$arr);
$userid = str_split($arr['userid']);
$timestamp = str_split($arr['timestamp']);
$puData = str_split($arr['puData']);
$ProgramID = str_split($n[$id]);
$Channel_ID = str_split("0116_25000000-99000-100300010010001");
$number = str_split("2624");
$s=count($puData);
for($v = 0; $v < $s/2; $v++){
$arr_key[] = $puData[$s-$v-1];
$arr_key[] = $puData[$v];
switch ($v){
case 1:
  $chars = $userid[$number[0]];
  $arr_key[] = arrkey($chars,$v);
break;  
case 2:
  $chars = $timestamp[$number[1]];
  $arr_key[] = arrkey($chars,$v);
break;  
case 3:
  $chars = $ProgramID[$number[2]];
  $arr_key[] = arrkey($chars,$v);
break;
case 4:
  $chars=$Channel_ID[count($Channel_ID)-$number[3]];
  $arr_key[]=arrkey($chars,$v);
break;
}
}
$ddCalcu = join($arr_key);

function arrkey($chars,$v){
$put = ['e','t','c','n'];   
if($chars!==null){
   $mark = $chars;   
  }else{
   $mark = $put[$v-1];
   }
return $mark;  
}
$p = $e."&ddCalcu=".$ddCalcu;
$headers = get_headers($p, true);
$url = $headers["Location"];
$path = parse_url($url)['path'];
$query = parse_url($url)['query'];
$playurl= 'http://h5.live.miguvideo.com'.$path.'?'.$query;
header('Location:'.$playurl);
//echo $playurl;
?>